W8D1/RedditClone/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "url", "content", "sub_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "Hi"], ["url", "google.com"], ["content", "My first post "], ["sub_id", 1], ["author_id", 1], ["created_at", "2021-03-08 23:14:21.468767"], ["updated_at", "2021-03-08 23:14:21.468767"]]
---
  def create
    @post = Post.new(post_params)
    @post.author_id = current_user.id
    if @post.save