W8D1/RedditClone/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "creator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "My First Sub"], ["description", "Hi World,  Here is my first sub."], ["creator_id", 1], ["created_at", "2021-03-08 22:16:07.724570"], ["updated_at", "2021-03-08 22:16:07.724570"]]
---
  def create
    @sub = Sub.new(sub_params)
    @sub.creator_id = current_user.id
    if @sub.save