W6D5/cat_rental/app/controllers/cats_controller.rb

  def update
    @cat = Cat.find_by(id: params[:id])

    if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["color", "tabby"], ["description", "really fat cat"], ["updated_at", "2021-02-27 00:38:58.130482"], ["id", 1]]