W6D3/First_Routes/FirstRoutes/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email") VALUES ($1, $2) RETURNING "id"  [["name", "Josh Smith"], ["email", "josh.smith@yahoo.com"]]
---
  def create
    user = User.new(new_user_info)

    if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1 WHERE "users"."id" = $2  [["email", "kyle@hotmail.com"], ["id", 5]]
---
  def update

    user = User.find_by(id: params[:id])

    if user.update(new_user_info)