W8D1/RedditClone/app/views/subs/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."sub_id" = $1  [["sub_id", 1]]
---
    <p><a href="<%= new_sub_post_url(@sub) %>">Make New Post!</a></p>
    <% @sub.posts.each do |post| %>